package com.javarush.test.level19.lesson08.task03;

/* Выводим только цифры
В методе main подмените объект System.out написанной вами ридер-оберткой по аналогии с лекцией
Ваша ридер-обертка должна выводить только цифры
Вызовите готовый метод printSomething(), воспользуйтесь testString
Верните переменной System.out первоначальный поток
Вывести модифицированную строку в консоль.

Пример вывода:
12345678
*/

import java.io.ByteArrayOutputStream;
import java.io.PrintStream;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class Solution {
    public static TestString testString = new TestString();

    public static void main(String[] args) {
        PrintStream consoleStream = System.out;

        ByteArrayOutputStream arr = new ByteArrayOutputStream();

        PrintStream stream = new PrintStream(arr);

        System.setOut(stream);

        testString.printSomething();

        Matcher m = Pattern.compile("\\D*(\\d+)\\D*").matcher(arr.toString());

        System.setOut(consoleStream);

        while (m.find())
        for (int i=1; i <= m.groupCount(); i++)
            System.out.print(m.group(i));

    }

    public static class TestString {
        public void printSomething() {
            System.out.println("it's 1 a 23 text 4 f5-6or7 tes8ting");
        }
    }
}
